app/views/descartes/_form.html.erb

                      <strong class="blue"> Asignatura</strong><br>
                      <%= collection_select(:prestamo, :signatura_id, Signatura.all, :id, :nomSig, prompt: true) %>
                      <tbody>
                        <td><%= collection_select(:descarte, :libro_id, Libro.all, :id, :AutLib, prompt: true) %></td>
---
SELECT "signaturas".* FROM "signaturas"
SELECT "libros".* FROM "libros"