app/views/prestamos/_form.html.erb

SELECT "signaturas".* FROM "signaturas"
---
          <strong>Signtura</strong><br>
          <%= collection_select(:prestamo, :signatura_id, Signatura.all, :id, :nomSig, prompt: true) %>

SELECT "libros".* FROM "libros"
---
          <strong>Libro</strong><br>
          <%= collection_select(:prestamo, :libro_id, Libro.all, :id, :TitLib, prompt: true) %>