app/views/items/_form.html.erb

          <strong>Lugar</strong><br>
          <%= collection_select(:item, :place_id, Place.all, :id, :NomPlace, prompt: true) %>
---
SELECT "places".* FROM "places"

          <strong>Categoria</strong><br>
          <%= collection_select(:item, :category_id, Category.all, :id, :nomCategory, prompt: true) %>
---
SELECT "categories".* FROM "categories"