app/views/libros/_form.html.erb

SELECT "editorials".* FROM "editorials"
---
          <strong>Editorial</strong> <br>
          <%= collection_select(:libro, :editorial_id, Editorial.all, :id, :NomEdi, prompt: true) %>