app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("nomCategory", "desCategory", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["nomCategory", "Muebles"], ["desCategory", "Sillas, mesas etc"], ["created_at", "2016-03-10 20:14:10.059573"], ["updated_at", "2016-03-10 20:14:10.059573"]]