app/controllers/descartes_controller.rb

SELECT "descartes".* FROM "descartes"
---
  def index
    @descartes = Descarte.all

INSERT INTO "descartes" ("ObsDesc", "CantLibDesc", "libro_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["ObsDesc", "no tengo"], ["CantLibDesc", 2], ["libro_id", 1], ["user_id", 1], ["created_at", "2016-03-10 22:07:54.124791"], ["updated_at", "2016-03-10 22:07:54.124791"]]
---
  def create
    @descarte = Descarte.new(descarte_params)
    @descarte.user = current_user

    respond_to do |format|
      if @descarte.save

UPDATE "descartes" SET "signatura_id" = $1, "updated_at" = $2 WHERE "descartes"."id" = $3  [["signatura_id", 1], ["updated_at", "2016-03-10 22:11:27.811648"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @descarte.update(descarte_params)

SELECT  "descartes".* FROM "descartes" WHERE "descartes"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_descarte
      @descarte = Descarte.find(params[:id])