app/controllers/editorials_controller.rb

  def index
    @editorials = Editorial.all
---
SELECT "editorials".* FROM "editorials"

  def create
    @editorial = Editorial.new(editorial_params)

    respond_to do |format|
      if @editorial.save
---
INSERT INTO "editorials" ("NomEdi", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["NomEdi", "La Nacion"], ["created_at", "2016-03-10 20:57:27.070044"], ["updated_at", "2016-03-10 20:57:27.070044"]]

    def set_editorial
      @editorial = Editorial.find(params[:id])
---
SELECT  "editorials".* FROM "editorials" WHERE "editorials"."id" = $1 LIMIT 1  [["id", 1]]