app/controllers/eventos_controller.rb

  def index
    @eventos = Evento.all
---
SELECT "eventos".* FROM "eventos"

  def create
    @evento = Evento.new(evento_params)
    @evento.user = current_user

    respond_to do |format|
      if @evento.save
---
INSERT INTO "eventos" ("NomEven", "DesEven", "objEven", "respEven", "partEven", "FecEvent", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

    def set_evento
      @evento = Evento.find(params[:id])
---
SELECT  "eventos".* FROM "eventos" WHERE "eventos"."id" = $1 LIMIT 1  [["id", 1]]