app/controllers/items_controller.rb

SELECT  "items".* FROM "items" WHERE (NomItem LIKE '%armario%')  ORDER BY created_at DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "items"
---
  def index
    @items = Item.all.paginate(page: params[:page], per_page: 10)

INSERT INTO "items" ("nomItem", "desItem", "canItem", "place_id", "category_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @item = Item.new(item_params)
    @item.user = current_user

    respond_to do |format|
      if @item.save