app/controllers/libros_controller.rb

  def index
    if params[:search]
      @libros = Libro.paginate(page: params[:page],:per_page => 15).search(params[:search]).order("created_at DESC")
---
SELECT  "libros".* FROM "libros"  ORDER BY created_at DESC LIMIT 15 OFFSET 0
SELECT COUNT(*) FROM "libros"

  def create
    @libro = Libro.new(libro_params)

    respond_to do |format|
      if @libro.save
---
INSERT INTO "libros" ("TitLib", "AutLib", "EdicLib", "AnioLib", "LugLib", "ObsLib", "DesLib", "CantLib", "CodDewLib", "editorial_id", "numInsc", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

    def set_libro
      @libro = Libro.find(params[:id])
---
SELECT  "libros".* FROM "libros" WHERE "libros"."id" = $1 LIMIT 1  [["id", 1]]