app/controllers/places_controller.rb

  def create
    @place = Place.new(place_params)

    respond_to do |format|
      if @place.save
---
INSERT INTO "places" ("NomPlace", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["NomPlace", "Aula 21"], ["created_at", "2016-03-10 20:13:37.010312"], ["updated_at", "2016-03-10 20:13:37.010312"]]

    def set_place
      @place = Place.find(params[:id])
---
SELECT  "places".* FROM "places" WHERE "places"."id" = $1 LIMIT 1  [["id", 1]]