app/controllers/prestamos_controller.rb

  def index
    @prestamos = Prestamo.all
---
SELECT "prestamos".* FROM "prestamos"

  def create
    @prestamo = Prestamo.new(prestamo_params)

    respond_to do |format|
      if @prestamo.save
---
INSERT INTO "prestamos" ("libro_id", "signatura_id", "seccion", "nomSolic", "telSolic", "nomDocente", "fecDev", "prestamo_estado_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"