app/controllers/prestamo_estados_controller.rb

  def index
    @prestamo_estados = PrestamoEstado.all
---
SELECT "prestamo_estados".* FROM "prestamo_estados"

  def create
    @prestamo_estado = PrestamoEstado.new(prestamo_estado_params)

    respond_to do |format|
      if @prestamo_estado.save
---
INSERT INTO "prestamo_estados" ("nomEstPres", "desEstPres", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["nomEstPres", "Solicitado"], ["desEstPres", "Libro ya fue solcitado"], ["created_at", "2016-03-11 00:56:58.566526"], ["updated_at", "2016-03-11 00:56:58.566526"]]

    def set_prestamo_estado
      @prestamo_estado = PrestamoEstado.find(params[:id])
---
SELECT  "prestamo_estados".* FROM "prestamo_estados" WHERE "prestamo_estados"."id" = $1 LIMIT 1  [["id", 1]]