app/controllers/queries_controller.rb

SELECT "queries".* FROM "queries"
---
  def index
    @queries = Query.all

INSERT INTO "queries" ("NomCon", "DesCon", "signatura_id", "info_solic", "propCons", "libCons", "nomLec", "seccion", "FecCon", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
  def create
    @query = Query.new(query_params)
    @query.user = current_user

    respond_to do |format|
      if @query.save

SELECT  "queries".* FROM "queries" WHERE "queries"."id" = $1 LIMIT 1  [["id", 2]]
---
    def set_query
      @query = Query.find(params[:id])