app/controllers/query_states_controller.rb

SELECT "query_states".* FROM "query_states"
---
  def index
    @query_states = QueryState.all