app/controllers/sessions_controller.rb

  def create
    user = User.find_by_CedUs(params[:CedUs])
---
SELECT  "users".* FROM "users" WHERE "users"."CedUs" = $1 LIMIT 1  [["CedUs", 0]]