app/controllers/signaturas_controller.rb

SELECT "signaturas".* FROM "signaturas"
---
  def index
    @signaturas = Signatura.all

INSERT INTO "signaturas" ("nomSig", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["nomSig", "Matematicas"], ["created_at", "2016-03-10 21:34:01.917809"], ["updated_at", "2016-03-10 21:34:01.917809"]]
---
  def create
    @signatura = Signatura.new(signatura_params)

    respond_to do |format|
      if @signatura.save

SELECT  "signaturas".* FROM "signaturas" WHERE "signaturas"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_signatura
      @signatura = Signatura.find(params[:id])