app/controllers/suggestions_controller.rb

SELECT "suggestions".* FROM "suggestions"
---
  def index
    @suggestions = Suggestion.all

INSERT INTO "suggestions" ("AutSug", "LibSug", "CantSug", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["AutSug", "Geroge R R"], ["LibSug", "Games of Thrones"], ["CantSug", "1"], ["user_id", 1], ["created_at", "2016-03-11 00:54:34.873426"], ["updated_at", "2016-03-11 00:54:34.873426"]]
---
  def create
    @suggestion = Suggestion.new(suggestion_params)
    @suggestion.user = current_user

    respond_to do |format|
      if @suggestion.save

SELECT  "suggestions".* FROM "suggestions" WHERE "suggestions"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_suggestion
      @suggestion = Suggestion.find(params[:id])