app/views/queries/_form.html.erb

SELECT "signaturas".* FROM "signaturas"
---
          <strong>Signatura</strong><br>
          <%= collection_select(:query, :signatura_id, Signatura.all, :id, :nomSig, prompt: true) %>